perf/concurrent_users.yaml
config:
  ensure:
    maxErrorRate: 0.1

  environments:
    node:
      target: 'http://localhost:5555/node'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"
    gunicorn:
      target: 'http://localhost:5555/gunicorn'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-gunicorn"
    node_replicated:
      target: 'http://localhost:5555/node_replicated'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node_replicated"


  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Ph1
      duration: 10
      arrivalRate: 1
    - pause: 50
    - name: Ph2
      duration: 10
      arrivalRate: 2
    - pause: 100
    - name: Ph3
      duration: 10
      arrivalRate: 3
    - pause: 150
    - name: Ph4
      duration: 10
      arrivalRate: 4
    - pause: 200
    - name: Ph5
      duration: 10
      arrivalRate: 5
    - pause: 250
    - name: Ph6
      duration: 10
      arrivalRate: 6
    - pause: 300
    - name: Ph7
      duration: 10
      arrivalRate: 7
    - pause: 350
    - name: Ph8
      duration: 10
      arrivalRate: 8
    - pause: 400
    - name: Ph9
      duration: 10
      arrivalRate: 9
    - pause: 450
    - name: Ph10
      duration: 10
      arrivalRate: 10
    - pause: 500
    - name: Ph11
      duration: 10
      arrivalRate: 11
    - pause: 550
    - name: Ph12
      duration: 10
      arrivalRate: 12
    - pause: 600
    - name: Ph13
      duration: 10
      arrivalRate: 13
    - pause: 650
    - name: Ph14
      duration: 10
      arrivalRate: 14
    - pause: 700
    - name: Ph15
      duration: 10
      arrivalRate: 15
    - pause: 750
    - name: Ph16
      duration: 10
      arrivalRate: 16
    - pause: 800
    - name: Ph17
      duration: 10
      arrivalRate: 17
    - pause: 850
    - name: Ph18
      duration: 10
      arrivalRate: 18
    - pause: 900
    - name: Ph19
      duration: 10
      arrivalRate: 19
    - pause: 950
    - name: Ph20
      duration: 10
      arrivalRate: 20
    - pause: 1000
    - name: Ph21
      duration: 10
      arrivalRate: 21
    - pause: 1050
    - name: Ph22
      duration: 10
      arrivalRate: 22
    - pause: 1100
    - name: Ph23
      duration: 10
      arrivalRate: 23
    - pause: 1150
    - name: Ph24
      duration: 10
      arrivalRate: 24
    - pause: 1200
    - name: Ph25
      duration: 10
      arrivalRate: 25
    - pause: 1250
    - name: Ph26
      duration: 10
      arrivalRate: 26
    - pause: 1300
    - name: Ph27
      duration: 10
      arrivalRate: 27
    - pause: 1350
    - name: Ph28
      duration: 10
      arrivalRate: 28
    - pause: 1400
    - name: Ph29
      duration: 10
      arrivalRate: 29
    - pause: 1450
    - name: Ph30
      duration: 10
      arrivalRate: 30
    - pause: 1500
    - name: Ph31
      duration: 10
      arrivalRate: 31
    - pause: 1550
    - name: Ph32
      duration: 10
      arrivalRate: 32
    - pause: 1600
    - name: Ph33
      duration: 10
      arrivalRate: 33
    - pause: 1650
    - name: Ph34
      duration: 10
      arrivalRate: 34
    - pause: 1700
    - name: Ph35
      duration: 10
      arrivalRate: 35
    - pause: 1750
    - name: Ph36
      duration: 10
      arrivalRate: 36
    - pause: 1800
    - name: Ph37
      duration: 10
      arrivalRate: 37
    - pause: 1850
    - name: Ph38
      duration: 10
      arrivalRate: 38
    - pause: 1900
    - name: Ph39
      duration: 10
      arrivalRate: 39
    - pause: 1950
    - name: Ph40
      duration: 10
      arrivalRate: 40
    - pause: 2000
    - name: Ph41
      duration: 10
      arrivalRate: 41
    - pause: 2050
    - name: Ph42
      duration: 10
      arrivalRate: 42
    - pause: 2100
    - name: Ph43
      duration: 10
      arrivalRate: 43
    - pause: 2150
    - name: Ph44
      duration: 10
      arrivalRate: 44
    - pause: 2200
    - name: Ph45
      duration: 10
      arrivalRate: 45
    - pause: 2250
    - name: Ph46
      duration: 10
      arrivalRate: 46
    - pause: 2300
    - name: Ph47
      duration: 10
      arrivalRate: 47
    - pause: 2350
    - name: Ph48
      duration: 10
      arrivalRate: 48
    - pause: 2400
    - name: Ph49
      duration: 10
      arrivalRate: 49
    - pause: 2450
    - name: Ph50
      duration: 10
      arrivalRate: 50
    - pause: 2500
    - name: Ph51
      duration: 10
      arrivalRate: 51
    - pause: 2550
    - name: Ph52
      duration: 10
      arrivalRate: 52
    - pause: 2600
    - name: Ph53
      duration: 10
      arrivalRate: 53
    - pause: 2650
    - name: Ph54
      duration: 10
      arrivalRate: 54
    - pause: 2700
    - name: Ph55
      duration: 10
      arrivalRate: 55
    - pause: 2750
    - name: Ph56
      duration: 10
      arrivalRate: 56
    - pause: 2800
    - name: Ph57
      duration: 10
      arrivalRate: 57
    - pause: 2850
    - name: Ph58
      duration: 10
      arrivalRate: 58
    - pause: 2900
    - name: Ph59
      duration: 10
      arrivalRate: 59
    - pause: 2950
    - name: Ph60
      duration: 10
      arrivalRate: 60
    - pause: 3000
    - name: Ph61
      duration: 10
      arrivalRate: 61
    - pause: 3050
    - name: Ph62
      duration: 10
      arrivalRate: 62
    - pause: 3100
    - name: Ph63
      duration: 10
      arrivalRate: 63
    - pause: 3150
    - name: Ph64
      duration: 10
      arrivalRate: 64
    - pause: 3200
    - name: Ph65
      duration: 10
      arrivalRate: 65
    - pause: 3250
    - name: Ph66
      duration: 10
      arrivalRate: 66
    - pause: 3300
    - name: Ph67
      duration: 10
      arrivalRate: 67
    - pause: 3350
    - name: Ph68
      duration: 10
      arrivalRate: 68
    - pause: 3400
    - name: Ph69
      duration: 10
      arrivalRate: 69
    - pause: 3450
    - name: Ph70
      duration: 10
      arrivalRate: 70
    - pause: 3500
    - name: Ph71
      duration: 10
      arrivalRate: 71
    - pause: 3550
    - name: Ph72
      duration: 10
      arrivalRate: 72
    - pause: 3600
    - name: Ph73
      duration: 10
      arrivalRate: 73
    - pause: 3650
    - name: Ph74
      duration: 10
      arrivalRate: 74
    - pause: 3700
    - name: Ph75
      duration: 10
      arrivalRate: 75
    - pause: 3750
    - name: Ph76
      duration: 10
      arrivalRate: 76
    - pause: 3800
    - name: Ph77
      duration: 10
      arrivalRate: 77
    - pause: 3850
    - name: Ph78
      duration: 10
      arrivalRate: 78
    - pause: 3900
    - name: Ph79
      duration: 10
      arrivalRate: 79
    - pause: 3950
    - name: Ph80
      duration: 10
      arrivalRate: 80
    - pause: 4000
    - name: Ph81
      duration: 10
      arrivalRate: 81
    - pause: 4050
    - name: Ph82
      duration: 10
      arrivalRate: 82
    - pause: 4100
    - name: Ph83
      duration: 10
      arrivalRate: 83
    - pause: 4150
    - name: Ph84
      duration: 10
      arrivalRate: 84
    - pause: 4200
    - name: Ph85
      duration: 10
      arrivalRate: 85
    - pause: 4250
    - name: Ph86
      duration: 10
      arrivalRate: 86
    - pause: 4300
    - name: Ph87
      duration: 10
      arrivalRate: 87
    - pause: 4350
    - name: Ph88
      duration: 10
      arrivalRate: 88
    - pause: 4400
    - name: Ph89
      duration: 10
      arrivalRate: 89
    - pause: 4450
    - name: Ph90
      duration: 10
      arrivalRate: 90
    - pause: 4500
    - name: Ph91
      duration: 10
      arrivalRate: 91
    - pause: 4550
    - name: Ph92
      duration: 10
      arrivalRate: 92
    - pause: 4600
    - name: Ph93
      duration: 10
      arrivalRate: 93
    - pause: 4650
    - name: Ph94
      duration: 10
      arrivalRate: 94
    - pause: 4700
    - name: Ph95
      duration: 10
      arrivalRate: 95
    - pause: 4750
    - name: Ph96
      duration: 10
      arrivalRate: 96
    - pause: 4800
    - name: Ph97
      duration: 10
      arrivalRate: 97
    - pause: 4850
    - name: Ph98
      duration: 10
      arrivalRate: 98
    - pause: 4900
    - name: Ph99
      duration: 10
      arrivalRate: 99
    - pause: 4950

scenarios:
  - name: Timeout
    flow:
      - get:
          url: '/timeout'